dns.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>dns</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="org0f1a13b">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-org39c6343" class="outline-2">
<h2 id="org39c6343">DNS</h2>
<div class="outline-text-2" id="text-org39c6343">
</div>
<div id="outline-container-orgb2b7f4b" class="outline-3">
<h3 id="orgb2b7f4b">notes</h3>
<div class="outline-text-3" id="text-orgb2b7f4b">
<ul class="org-ul">
<li><a href="pihole.html#ID-eadf1db2-5c2a-4dbe-b17e-74048162787b">pihole</a> for dns cache/forwarder</li>
<li>SRV records for port numbers</li>
<li>pozzed by companies
<ul class="org-ul">
<li>pay to play or have domain highjacked by adds once traffic increases</li>
<li>piratebay domain wars</li>
<li>numerous known malware domains exist for years</li>
<li>few implement security 'properly'
<ul class="org-ul">
<li>wildcard cert pinning with BGP route hijack protection (crypto exchange was attacked by this)</li>
</ul></li>
<li>registrars are generally rent seeking tater heads
<ul class="org-ul">
<li>cloudflare takes law into own handles despite claims of being 'impartial'
<ul class="org-ul">
<li>extortion racket for ddos protection
<ul class="org-ul">
<li>blocks sites that <a href="https://cloudflarehatecredits.org/">critic them</a> on 1.1.1.3</li>
<li>allows 'stressers', malware, doxing for hire services to remain in perpetuity
<ul class="org-ul">
<li>malwarebytes blocked cloudflare ip space because of their unresponsiveness. Cloudflare doubled down despite logs of malware saying it was 'protected speech' to distribute malware</li>
</ul></li>
<li>personal threats to individuals who criticized them
<ul class="org-ul">
<li>ex. cloudbleed, cloudflare lobbied the FTC to <a href="https://twitter.com/taviso/status/1566077115992133634">personally investigate the security researchers</a> and questioned the legality of openly discussing security research</li>
</ul></li>
</ul></li>
<li>banned 8chan</li>
<li>banned kiwifarms (banned by ddos guard the next day)</li>
</ul></li>
<li>namecheap ceo challenges 'security researchers' to hack their <b>customers</b> accounts on twitter for 'clout'
<ul class="org-ul">
<li>less than a day after their support portal leaks <a href="https://nitter.net/ReneReh1/status/1564349884106477573#m">db info</a></li>
</ul></li>
</ul></li>
</ul></li>
<li>Certificate Transparency logs <a href="https://www.gstatic.com/ct/log_list/v3/all_logs_list.json">https://www.gstatic.com/ct/log_list/v3/all_logs_list.json</a> with schema <a href="https://www.gstatic.com/ct/log_list/v3/log_list_schema.json">https://www.gstatic.com/ct/log_list/v3/log_list_schema.json</a>.</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
